Конфигурация/Catalogs/Expenditures.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Expenditures</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ShowInExpenseReport</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ArticlePlan</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PlanExpenitures</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Catalogs/Expenditures/Ext/ManagerModule.bsl
Procedure InitialFilltype() Export
	Selection = Catalogs.Expenditures.Select();
	IF Not Selection.Next() Then
		Names = New Array;
		Names.Add(NStr("ru = 'Other expences'; en = 'Other'"));
		Names.Add(NStr("ru = 'Adjustment balance'; en = 'Balance correction'"));
		
		For Each Description In Names Do
			IF Not ValueIsFilled(Catalogs.Expenditures.FindByDescription(Description)) Then
				El = Catalogs.Expenditures.CreateItem();
				El.Description                = Description;
				El.ShowInExpenseReport = True;
				El.ArticlePlan                 = Catalogs.PlanExpenitures.Others;
				El.Write();
			EndIf;
		EndDo;	
	EndIf;	
EndProcedure
